jmeter/test-result/1-jersey-monolith/statistics.json
{
  "SC0106002-DisputeNotation" : {
    "transaction" : "SC0106002-DisputeNotation",
    "sampleCount" : 300,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 59.76333333333333,
    "medianResTime" : 26.0,
    "minResTime" : 10.0,
    "maxResTime" : 359.0,
    "pct1ResTime" : 164.90000000000003,
    "pct2ResTime" : 230.69999999999993,
    "pct3ResTime" : 352.6700000000003,
    "throughput" : 19.893899204244033,
    "receivedKBytesPerSec" : 4.682060261936339,
    "sentKBytesPerSec" : 5.7117249668435015
  },
  "SC0107001-FeePayment" : {
    "transaction" : "SC0107001-FeePayment",
    "sampleCount" : 300,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 3804.656666666667,
    "medianResTime" : 3404.5,
    "minResTime" : 2170.0,
    "maxResTime" : 9314.0,
    "pct1ResTime" : 5451.6,
    "pct2ResTime" : 7144.899999999997,
    "pct3ResTime" : 8827.67,
    "throughput" : 8.821972593071811,
    "receivedKBytesPerSec" : 2.0762650341116275,
    "sentKBytesPerSec" : 2.9119401723225313
  },
  "SC0104001-Transaction" : {
    "transaction" : "SC0104001-Transaction",
    "sampleCount" : 300,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 3606.1933333333313,
    "medianResTime" : 3373.0,
    "minResTime" : 1289.0,
    "maxResTime" : 9712.0,
    "pct1ResTime" : 4733.200000000003,
    "pct2ResTime" : 6645.999999999999,
    "pct3ResTime" : 8928.700000000004,
    "throughput" : 7.203400004802266,
    "receivedKBytesPerSec" : 1.695331446442721,
    "sentKBytesPerSec" : 4.530263284270176
  },
  "SC0103001-Activation" : {
    "transaction" : "SC0103001-Activation",
    "sampleCount" : 300,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 1939.9166666666667,
    "medianResTime" : 1165.0,
    "minResTime" : 810.0,
    "maxResTime" : 7442.0,
    "pct1ResTime" : 3601.2000000000007,
    "pct2ResTime" : 5142.299999999998,
    "pct3ResTime" : 7134.880000000001,
    "throughput" : 5.729236292802169,
    "receivedKBytesPerSec" : 1.348384713442698,
    "sentKBytesPerSec" : 1.628132579302179
  },
  "Total" : {
    "transaction" : "Total",
    "sampleCount" : 2100,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 2209.1852380952346,
    "medianResTime" : 1919.0,
    "minResTime" : 10.0,
    "maxResTime" : 12407.0,
    "pct1ResTime" : 4356.100000000002,
    "pct2ResTime" : 5500.449999999991,
    "pct3ResTime" : 8639.61999999997,
    "throughput" : 30.00943153562548,
    "receivedKBytesPerSec" : 6825.011716852083,
    "sentKBytesPerSec" : 13.55615782817457
  },
  "SC0102001-Review" : {
    "transaction" : "SC0102001-Review",
    "sampleCount" : 300,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 2454.6200000000003,
    "medianResTime" : 2446.5,
    "minResTime" : 857.0,
    "maxResTime" : 8641.0,
    "pct1ResTime" : 4051.2000000000007,
    "pct2ResTime" : 4882.5999999999985,
    "pct3ResTime" : 7983.790000000002,
    "throughput" : 5.4099868356986995,
    "receivedKBytesPerSec" : 1.2732488548861196,
    "sentKBytesPerSec" : 1.864966165040665
  },
  "SC0101001-Application" : {
    "transaction" : "SC0101001-Application",
    "sampleCount" : 300,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 3155.580000000002,
    "medianResTime" : 3245.5,
    "minResTime" : 849.0,
    "maxResTime" : 12407.0,
    "pct1ResTime" : 5256.100000000001,
    "pct2ResTime" : 6963.299999999999,
    "pct3ResTime" : 11267.420000000004,
    "throughput" : 5.190760446405399,
    "receivedKBytesPerSec" : 1.221653581624708,
    "sentKBytesPerSec" : 5.241451466389826
  },
  "SC0106001-TransactionQuery" : {
    "transaction" : "SC0106001-TransactionQuery",
    "sampleCount" : 300,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 443.56666666666666,
    "medianResTime" : 352.5,
    "minResTime" : 71.0,
    "maxResTime" : 1371.0,
    "pct1ResTime" : 998.9000000000001,
    "pct2ResTime" : 1078.9,
    "pct3ResTime" : 1326.5200000000004,
    "throughput" : 7.851553298960978,
    "receivedKBytesPerSec" : 12488.603133015125,
    "sentKBytesPerSec" : 2.1775792352587087
  }
}