jmeter/test-result/2-jersey-modular-monolith/statistics.json
{
  "SC0106002-DisputeNotation" : {
    "transaction" : "SC0106002-DisputeNotation",
    "sampleCount" : 300,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 1429.4366666666665,
    "medianResTime" : 151.5,
    "minResTime" : 11.0,
    "maxResTime" : 5622.0,
    "pct1ResTime" : 4698.400000000001,
    "pct2ResTime" : 5177.0,
    "pct3ResTime" : 5590.98,
    "throughput" : 14.58221941379478,
    "receivedKBytesPerSec" : 3.4319481237544354,
    "sentKBytesPerSec" : 4.386058183055461
  },
  "SC0107001-FeePayment" : {
    "transaction" : "SC0107001-FeePayment",
    "sampleCount" : 300,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 6708.909999999998,
    "medianResTime" : 7358.0,
    "minResTime" : 863.0,
    "maxResTime" : 19003.0,
    "pct1ResTime" : 12510.7,
    "pct2ResTime" : 14861.699999999997,
    "pct3ResTime" : 15870.490000000002,
    "throughput" : 8.2540031915479,
    "receivedKBytesPerSec" : 1.9425925480107855,
    "sentKBytesPerSec" : 2.7970108471358612
  },
  "SC0104001-Transaction" : {
    "transaction" : "SC0104001-Transaction",
    "sampleCount" : 300,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 5564.413333333332,
    "medianResTime" : 4312.5,
    "minResTime" : 859.0,
    "maxResTime" : 17860.0,
    "pct1ResTime" : 11869.100000000004,
    "pct2ResTime" : 14634.549999999992,
    "pct3ResTime" : 16480.300000000003,
    "throughput" : 6.6792830902816425,
    "receivedKBytesPerSec" : 1.5719797116776133,
    "sentKBytesPerSec" : 4.2658702549259715
  },
  "SC0103001-Activation" : {
    "transaction" : "SC0103001-Activation",
    "sampleCount" : 300,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 1393.0833333333342,
    "medianResTime" : 1372.0,
    "minResTime" : 845.0,
    "maxResTime" : 3137.0,
    "pct1ResTime" : 2169.9,
    "pct2ResTime" : 2493.1499999999996,
    "pct3ResTime" : 2938.330000000001,
    "throughput" : 6.051315152493142,
    "receivedKBytesPerSec" : 1.4241864763191867,
    "sentKBytesPerSec" : 1.7728462360819752
  },
  "Total" : {
    "transaction" : "Total",
    "sampleCount" : 2100,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 3413.919047619044,
    "medianResTime" : 1579.5,
    "minResTime" : 11.0,
    "maxResTime" : 19003.0,
    "pct1ResTime" : 10084.300000000001,
    "pct2ResTime" : 12096.899999999996,
    "pct3ResTime" : 15446.469999999988,
    "throughput" : 27.95006255490191,
    "receivedKBytesPerSec" : 7282.175039970253,
    "sentKBytesPerSec" : 12.90662765858333
  },
  "SC0102001-Review" : {
    "transaction" : "SC0102001-Review",
    "sampleCount" : 300,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 3785.100000000004,
    "medianResTime" : 1582.0,
    "minResTime" : 864.0,
    "maxResTime" : 15589.0,
    "pct1ResTime" : 9721.300000000001,
    "pct2ResTime" : 11388.849999999995,
    "pct3ResTime" : 14608.780000000004,
    "throughput" : 4.808848280836739,
    "receivedKBytesPerSec" : 1.1317699567203654,
    "sentKBytesPerSec" : 1.681218441933157
  },
  "SC0101001-Application" : {
    "transaction" : "SC0101001-Application",
    "sampleCount" : 300,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 4189.410000000001,
    "medianResTime" : 1621.0,
    "minResTime" : 866.0,
    "maxResTime" : 17132.0,
    "pct1ResTime" : 11404.300000000001,
    "pct2ResTime" : 12766.35,
    "pct3ResTime" : 15896.250000000002,
    "throughput" : 4.744958481613287,
    "receivedKBytesPerSec" : 1.1167333926453142,
    "sentKBytesPerSec" : 4.837633451957295
  },
  "SC0106001-TransactionQuery" : {
    "transaction" : "SC0106001-TransactionQuery",
    "sampleCount" : 300,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 827.0800000000003,
    "medianResTime" : 232.5,
    "minResTime" : 80.0,
    "maxResTime" : 4177.0,
    "pct1ResTime" : 2084.9,
    "pct2ResTime" : 2265.85,
    "pct3ResTime" : 4083.810000000005,
    "throughput" : 6.9365765682443525,
    "receivedKBytesPerSec" : 12641.108618479617,
    "sentKBytesPerSec" : 2.0254261659229114
  }
}