jmeter/test-result/9-springboot-microservice-gateway/statistics.json
{
  "SC0106002-DisputeNotation" : {
    "transaction" : "SC0106002-DisputeNotation",
    "sampleCount" : 300,
    "errorCount" : 246,
    "errorPct" : 82.0,
    "meanResTime" : 25962.46333333333,
    "medianResTime" : 12814.5,
    "minResTime" : 1729.0,
    "maxResTime" : 69676.0,
    "pct1ResTime" : 65981.5,
    "pct2ResTime" : 67734.7,
    "pct3ResTime" : 69336.62000000001,
    "throughput" : 3.04130086575698,
    "receivedKBytesPerSec" : 1.2367164848644594,
    "sentKBytesPerSec" : 1.101877559761562
  },
  "SC0107001-FeePayment" : {
    "transaction" : "SC0107001-FeePayment",
    "sampleCount" : 300,
    "errorCount" : 26,
    "errorPct" : 8.666667,
    "meanResTime" : 26152.91666666667,
    "medianResTime" : 12854.0,
    "minResTime" : 3083.0,
    "maxResTime" : 70263.0,
    "pct1ResTime" : 63362.200000000004,
    "pct2ResTime" : 65107.09999999999,
    "pct3ResTime" : 67492.61,
    "throughput" : 2.9797377830750893,
    "receivedKBytesPerSec" : 1.18419357742352,
    "sentKBytesPerSec" : 1.1930590733015494
  },
  "SC0104001-Transaction" : {
    "transaction" : "SC0104001-Transaction",
    "sampleCount" : 300,
    "errorCount" : 195,
    "errorPct" : 65.0,
    "meanResTime" : 15285.806666666682,
    "medianResTime" : 8395.0,
    "minResTime" : 764.0,
    "maxResTime" : 73763.0,
    "pct1ResTime" : 57512.100000000006,
    "pct2ResTime" : 65310.85,
    "pct3ResTime" : 72434.81000000001,
    "throughput" : 2.8229183329726273,
    "receivedKBytesPerSec" : 1.1433646275394502,
    "sentKBytesPerSec" : 1.9903779652404656
  },
  "SC0103001-Activation" : {
    "transaction" : "SC0103001-Activation",
    "sampleCount" : 300,
    "errorCount" : 17,
    "errorPct" : 5.6666665,
    "meanResTime" : 4001.4866666666708,
    "medianResTime" : 1850.0,
    "minResTime" : 986.0,
    "maxResTime" : 16771.0,
    "pct1ResTime" : 10300.300000000001,
    "pct2ResTime" : 12434.499999999998,
    "pct3ResTime" : 15704.94,
    "throughput" : 4.394831677946734,
    "receivedKBytesPerSec" : 1.7245136386276405,
    "sentKBytesPerSec" : 1.5708089786411181
  },
  "Total" : {
    "transaction" : "Total",
    "sampleCount" : 2100,
    "errorCount" : 768,
    "errorPct" : 36.57143,
    "meanResTime" : 16604.9638095238,
    "medianResTime" : 7878.5,
    "minResTime" : 213.0,
    "maxResTime" : 75537.0,
    "pct1ResTime" : 61396.600000000006,
    "pct2ResTime" : 65394.6,
    "pct3ResTime" : 69675.06999999998,
    "throughput" : 14.489453747593716,
    "receivedKBytesPerSec" : 440.24360340208926,
    "sentKBytesPerSec" : 7.620708793028503
  },
  "SC0102001-Review" : {
    "transaction" : "SC0102001-Review",
    "sampleCount" : 300,
    "errorCount" : 17,
    "errorPct" : 5.6666665,
    "meanResTime" : 7913.560000000008,
    "medianResTime" : 1971.5,
    "minResTime" : 927.0,
    "maxResTime" : 48483.0,
    "pct1ResTime" : 43301.20000000003,
    "pct2ResTime" : 46562.8,
    "pct3ResTime" : 48329.85,
    "throughput" : 2.6404034536477172,
    "receivedKBytesPerSec" : 1.033599340229187,
    "sentKBytesPerSec" : 1.093292055026008
  },
  "SC0106001-TransactionQuery" : {
    "transaction" : "SC0106001-TransactionQuery",
    "sampleCount" : 300,
    "errorCount" : 250,
    "errorPct" : 83.333336,
    "meanResTime" : 18456.72666666667,
    "medianResTime" : 8878.0,
    "minResTime" : 213.0,
    "maxResTime" : 75537.0,
    "pct1ResTime" : 61891.9,
    "pct2ResTime" : 67123.9,
    "pct3ResTime" : 73088.57,
    "throughput" : 2.907822041291073,
    "receivedKBytesPerSec" : 611.5057084938693,
    "sentKBytesPerSec" : 1.042158876126781
  },
  "SC0101001-Application" : {
    "transaction" : "SC0101001-Application",
    "sampleCount" : 300,
    "errorCount" : 17,
    "errorPct" : 5.6666665,
    "meanResTime" : 18461.786666666663,
    "medianResTime" : 4368.5,
    "minResTime" : 939.0,
    "maxResTime" : 69575.0,
    "pct1ResTime" : 63980.600000000006,
    "pct2ResTime" : 66371.4,
    "pct3ResTime" : 68543.81,
    "throughput" : 2.36860181434899,
    "receivedKBytesPerSec" : 0.9387666468296265,
    "sentKBytesPerSec" : 2.5675273573509556
  }
}